JCardenas05/ESP_CAM/firmware/sdkconfig.defaults
# --- Placa: Waveshare ESP32-S3-Touch-LCD-2 (ESP32-S3R8) ---
CONFIG_IDF_TARGET="esp32s3"

# Flash 16 MB, QIO @80 MHz (eFuse de la placa: quad, 3.3 V)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# PSRAM 8 MB embebida, octal @80 MHz
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# CPU a tope: la camara y LVGL lo necesitan
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Tick de 1 kHz para que LVGL vaya fino
CONFIG_FREERTOS_HZ=1000

# Consola por el USB-JTAG nativo: la placa no lleva puente USB-UART
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Tabla de particiones propia (app grande + almacenamiento)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- LVGL 8.4 ---
CONFIG_LV_COLOR_DEPTH_16=y
# El ST7789 quiere RGB565 big-endian, asi que LVGL debe generar los bytes ya girados
CONFIG_LV_COLOR_16_SWAP=y
CONFIG_LV_MEM_SIZE_KILOBYTES=48
CONFIG_LV_USE_PERF_MONITOR=n

# --- Red: subidas sostenidas ---
# Con los valores por defecto (5760 B de buffer de envio) una subida de 30 KB
# se atasca tras los primeros 4 KB esperando ACK.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534
